
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Объект,
		|	КонтактнаяИнформация.Тип,
		|	КонтактнаяИнформация.Вид,
		|	КонтактнаяИнформация.Представление,
		|	КонтактнаяИнформация.Поле1,
		|	КонтактнаяИнформация.Поле2,
		|	КонтактнаяИнформация.Поле3,
		|	КонтактнаяИнформация.Поле4,
		|	КонтактнаяИнформация.Поле5,
		|	КонтактнаяИнформация.Поле6,
		|	КонтактнаяИнформация.Поле7,
		|	КонтактнаяИнформация.Поле8,
		|	КонтактнаяИнформация.Поле9,
		|	КонтактнаяИнформация.Поле10,
		|	КонтактнаяИнформация.Комментарий
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|	И КонтактнаяИнформация.Объект = &Объект";
		Если ЗначениеЗаполнено(Контрагент) Тогда
			Запрос.УстановитьПараметр("Объект",Контрагент);
		Иначе	
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"КонтактнаяИнформация.Объект = &Объект","Истина");
		КонецЕсли;	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Представление = ВыборкаДетальныеЗаписи.Представление;
		Если ЗначениеЗаполнено(Представление) Тогда
			ПредставлениеЦифры = ОставитьЦифры(Представление);
			ДлинаЦифр = СтрДлина(ПредставлениеЦифры);
			//Сообщить(ДлинаЦифр);
			Если ДлинаЦифр = 10 Тогда
				ПредставлениеЦифры = "7"+ПредставлениеЦифры;
			ИначеЕсли ДлинаЦифр = 11 и Лев(ПредставлениеЦифры,1)="8" Тогда	
				ПредставлениеЦифры = "7"+Прав(ПредставлениеЦифры,10);
			ИначеЕсли ДлинаЦифр =6 Тогда	
				ПредставлениеЦифры = "73422"+ПредставлениеЦифры;
			ИначеЕсли ДлинаЦифр =7 Тогда	
				ПредставлениеЦифры = "7342"+ПредставлениеЦифры;
			КонецЕсли;	
			Если СтрДлина(ПредставлениеЦифры)=11 Тогда
				МЗ = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
				МЗ.Объект = ВыборкаДетальныеЗаписи.Объект;
				МЗ.Вид = ВыборкаДетальныеЗаписи.Вид;
				МЗ.Тип = ВыборкаДетальныеЗаписи.Тип;
				МЗ.Прочитать();
				МЗ.Поле1 = "+"+Лев(ПредставлениеЦифры,1);
				МЗ.Поле2 = Сред(ПредставлениеЦифры,2,3);
				МЗ.Поле3 = Сред(ПредставлениеЦифры,5,7);
				МЗ.Поле10 = ПредставлениеЦифры;
				МЗ.Записать();
			Иначе
				МЗ = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
				МЗ.Объект = ВыборкаДетальныеЗаписи.Объект;
				МЗ.Вид = ВыборкаДетальныеЗаписи.Вид;
				МЗ.Тип = ВыборкаДетальныеЗаписи.Тип;
				МЗ.Прочитать();
				МЗ.Поле3 = ПредставлениеЦифры;
				МЗ.Поле10 = ПредставлениеЦифры;
				МЗ.Записать();
			КонецЕсли;	
			//Сообщить(""+МЗ.Представление+" "+МЗ.Поле1+" "+МЗ.Поле2+" "+МЗ.Поле3+" "+МЗ.Поле10);
		КонецЕсли;	
	КонецЦикла;
	

	
КонецПроцедуры

Функция ОставитьЦифры(ВходящийТекст)
	Цифры = "0123456789";
	ИсходящийТекст = "";
	Для н=1 по СтрДлина(ВходящийТекст) Цикл
		СимволТекста = Сред(ВходящийТекст,н,1);
		Если Найти(Цифры,СимволТекста)>0 Тогда
			ИсходящийТекст = ИсходящийТекст+СимволТекста;
		КонецЕсли;	
		
	КонецЦикла;	
	Возврат ИсходящийТекст;
КонецФункции

Процедура ОсновныеДействияФормыОчистить(Кнопка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Объект,
		|	КонтактнаяИнформация.Тип,
		|	КонтактнаяИнформация.Вид,
		|	КонтактнаяИнформация.Представление,
		|	КонтактнаяИнформация.Поле1,
		|	КонтактнаяИнформация.Поле2,
		|	КонтактнаяИнформация.Поле3,
		|	КонтактнаяИнформация.Поле4,
		|	КонтактнаяИнформация.Поле5,
		|	КонтактнаяИнформация.Поле6,
		|	КонтактнаяИнформация.Поле7,
		|	КонтактнаяИнформация.Поле8,
		|	КонтактнаяИнформация.Поле9,
		|	КонтактнаяИнформация.Поле10,
		|	КонтактнаяИнформация.Комментарий
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|	И КонтактнаяИнформация.Объект = &Объект";
		Если ЗначениеЗаполнено(Контрагент) Тогда
			Запрос.УстановитьПараметр("Объект",Контрагент);
		Иначе	
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"КонтактнаяИнформация.Объект = &Объект","Истина");
		КонецЕсли;	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Количество = ВыборкаДетальныеЗаписи.Количество();
	
	Счетчик = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		МЗ = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		МЗ.Объект = ВыборкаДетальныеЗаписи.Объект;
		МЗ.Вид = ВыборкаДетальныеЗаписи.Вид;
		МЗ.Тип = ВыборкаДетальныеЗаписи.Тип;
		МЗ.Прочитать();
		МЗ.Поле10 = "";
		МЗ.Записать();
		
		Счетчик = Счетчик + 1;
		
		Состояние(""+Счетчик+"/"+Количество);
		
	КонецЦикла;
	
КонецПроцедуры


