//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"УМеняЕстьПервоеСлогаемеоеРавное(Парам01)","УМеняЕстьПервоеСлогаемеоеРавное","Допустим у меня есть первое слогаемеое равное 10");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"УМеняЕстьВтороеСлогаемеоеРавное(Парам01)","УМеняЕстьВтороеСлогаемеоеРавное","И у меня есть второе слогаемеое равное 15.5");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"РезультатСложенияБудетРавен(Парам01)","РезультатСложенияБудетРавен","Тогда результат сложения будет равен 25.5");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим у меня есть первое слогаемеое равное 10
//@УМеняЕстьПервоеСлогаемеоеРавное(Парам01)
Процедура УМеняЕстьПервоеСлогаемеоеРавное(ПервоеСлагаемое) Экспорт

	Контекст.Вставить("ПервоеСлагаемое",ПервоеСлагаемое);
	//ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//И у меня есть второе слогаемеое равное 15.5
//@УМеняЕстьВтороеСлогаемеоеРавное(Парам01)
Процедура УМеняЕстьВтороеСлогаемеоеРавное(ВтороееСлагаемое) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	Контекст.Вставить("ВтороееСлагаемое",ВтороееСлагаемое);

	//ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Тогда результат сложения будет равен 25.5
//@РезультатСложенияБудетРавен(Парам01)
Процедура РезультатСложенияБудетРавен(ОжидаемыйРезультат) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	//ВызватьИсключение "Не реализовано.";
	
	Реузльтат =  ПолучитьРезультатСложения(Контекст.ПервоеСлагаемое,Контекст.ВтороееСлагаемое);
	
	Если Не Реузльтат = ОжидаемыйРезультат Тогда 
		ВызватьИсключение "Результат рассчтан не верно";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРезультатСложения(Число1,Число2)
	Возврат Число1+Число2;
КонецФункции


//окончание текста модуля